I got the Control plan upgraded from 4.14.8 to 4.14.9.  Now, I want to upgrade the Compute nodes.  I have this .tf file:
```
resource "rhcs_hcp_machine_pool" "pools" {
  cluster = "29l7dcmufhk2oates01chdidfnt52tos"
  name = "workers-0"
  autoscaling = {
    enabled = false
  }
  upgrade_acknowledgements_for = "4.14"
  version = "4.14.9"
  subnet_id = "subnet-01c6b70e154657ea0"
}
```

Getting error when doing the terraform apply:
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # rhcs_hcp_machine_pool.pools will be created
  + resource "rhcs_hcp_machine_pool" "pools" {
      + auto_repair                  = (known after apply)
      + autoscaling                  = {
          + enabled = false
        }
      + availability_zone            = (known after apply)
      + cluster                      = "29l7dcmufhk2oates01chdidfnt52tos"
      + current_version              = (known after apply)
      + id                           = (known after apply)
      + name                         = "workers-0"
      + status                       = (known after apply)
      + subnet_id                    = "subnet-01c6b70e154657ea0"
      + upgrade_acknowledgements_for = "4.14"
resource "rhcs_hcp_machine_pool" "pools" {
resource "rhcs_hcp_machine_pool" "pools" {
      + version                      = "4.14.9"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

rhcs_hcp_machine_pool.pools: Creating...
╷
│ Error: Can't upgrade machine pool
│
│   with rhcs_hcp_machine_pool.pools,
│   on main.tf line 1, in resource "rhcs_hcp_machine_pool" "pools":
│    1: resource "rhcs_hcp_machine_pool" "pools" {
│
│ Can't upgrade machine pool version with identifier: `workers-0`, failed to check for missing upgrade agreements: failed to check for missing gate agreements upgrade for
│ cluster '29l7dcmufhk2oates01chdidfnt52tos': Only 'NodePool' upgrade type is supported
╵
```

How to upgrade HCP Compute nodes?